# RebarSystemAddlExteriorOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemAddlExteriorOffset Property
ParameterTypeId Class See Also
---
"Additional Exterior Cover Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemAddlExteriorOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemAddlExteriorOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemAddlExteriorOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace